{"class_name": "Model", "config": {"name": "predictor", "layers": [{"name": "peptide", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 21], "dtype": "float32", "sparse": false, "name": "peptide"}, "inbound_nodes": []}, {"name": "lc_0", "class_name": "LocallyConnected1D", "config": {"name": "lc_0", "trainable": true, "filters": 8, "kernel_size": [5], "strides": [1], "padding": "valid", "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["peptide", 0, 0, {}]]]}, {"name": "flattened_0", "class_name": "Flatten", "config": {"name": "flattened_0", "trainable": true}, "inbound_nodes": [[["lc_0", 0, 0, {}]]]}, {"name": "dense_0", "class_name": "Dense", "config": {"name": "dense_0", "trainable": true, "units": 16, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flattened_0", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_0", 0, 0, {}]]]}], "input_layers": [["peptide", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.1.3", "backend": "tensorflow"}