{"hyperparameters": {"activation": "tanh", "batch_normalization": false, "dense_layer_l1_regularization": 0.0, "dropout_probability": 0.0, "early_stopping": true, "embedding_output_dim": 8, "kmer_size": 15, "layer_sizes": [16], "locally_connected_layers": [{"activation": "tanh", "filters": 8, "kernel_size": 5}], "loss": "custom:mse_with_inequalities", "max_epochs": 500, "minibatch_size": 128, "output_activation": "sigmoid", "patience": 20, "peptide_amino_acid_encoding": "BLOSUM62", "random_negative_affinity_max": 50000.0, "random_negative_affinity_min": 20000.0, "random_negative_constant": 25, "random_negative_rate": 0.0, "train_data": {"pretrain_min_points": 1000, "subset": "all"}, "validation_split": 0.1, "embedding_input_dim": 21, "allele_dense_layer_sizes": [], "peptide_dense_layer_sizes": [], "peptide_allele_merge_method": "multiply", "peptide_allele_merge_activation": "", "dense_layer_l2_regularization": 0.0, "init": "glorot_uniform", "embedding_init_method": "glorot_uniform", "optimizer": "rmsprop", "learning_rate": null, "left_edge": 4, "right_edge": 4, "random_negative_match_distribution": true, "random_negative_distribution_smoothing": 0.0}, "_network": null, "network_json": {"class_name": "Model", "config": {"name": "predictor", "layers": [{"name": "peptide", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 21], "dtype": "float32", "sparse": false, "name": "peptide"}, "inbound_nodes": []}, {"name": "lc_0", "class_name": "LocallyConnected1D", "config": {"name": "lc_0", "trainable": true, "filters": 8, "kernel_size": [5], "strides": [1], "padding": "valid", "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["peptide", 0, 0, {}]]]}, {"name": "flattened_0", "class_name": "Flatten", "config": {"name": "flattened_0", "trainable": true}, "inbound_nodes": [[["lc_0", 0, 0, {}]]]}, {"name": "dense_0", "class_name": "Dense", "config": {"name": "dense_0", "trainable": true, "units": 16, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flattened_0", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_0", 0, 0, {}]]]}], "input_layers": [["peptide", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.1.3", "backend": "tensorflow"}, "network_weights": null, "network_weights_loader": null, "fit_info": [{"val_loss": [0.04292228980386843, 0.03490627221152431, 0.033347421102836484, 0.030877712796457478, 0.030742507415716765, 0.03425078808528478, 0.02950128258251753, 0.030765158878486666, 0.03126304280318198, 0.03146599797440357, 0.0295508653414054, 0.029956006380866786, 0.030407770063544882, 0.03190922213138127, 0.03006241695314157, 0.03317628806976021, 0.03096081248072327, 0.033731733409107706, 0.03133058682328365, 0.03034641582702027, 0.03143152086461177, 0.033643849426117096, 0.03175782790926636, 0.032557573267182366, 0.03494360915950087, 0.03129560996274479, 0.032339805034828965, 0.03154223777475904], "loss": [0.05055030413514155, 0.03535582753112015, 0.031091279100022698, 0.028654403032671465, 0.02664862320400515, 0.02642728867100665, 0.02509786454699465, 0.024591394442777532, 0.023248049183068387, 0.022989126628585134, 0.022732864285355696, 0.021523615938497356, 0.021210460973040326, 0.02062466704598661, 0.020280797288097615, 0.01989375855471343, 0.019904658920925702, 0.01909037361292808, 0.018992318418648107, 0.018418369167430837, 0.018024580501197963, 0.017924270416828546, 0.01783682277842951, 0.01711874621299123, 0.01696683013869119, 0.016962534624022623, 0.016064920410352176, 0.016054864562626642], "time": 12.809186458587646, "num_points": 5893}, {"val_loss": [0.011733370833098888, 0.010036383755505085, 0.010439751669764519, 0.010009393095970154, 0.009786617010831833, 0.011093919165432453, 0.009810175746679306, 0.00950445607304573, 0.010712902061641216, 0.012917738407850266, 0.01067924965173006, 0.01031786110252142, 0.010810798034071922, 0.011035844683647156, 0.011283914558589458, 0.01047852449119091, 0.011198777705430984, 0.01293956022709608, 0.010965144261717796, 0.017911117523908615, 0.023622380569577217, 0.012695842422544956, 0.012818834744393826, 0.016734616830945015, 0.012592813931405544, 0.01739238202571869, 0.021535048261284828, 0.013614125549793243, 0.013436323963105679], "loss": [0.011903946885483803, 0.008063902887327307, 0.00798871289303451, 0.006555267542363763, 0.009040619787690095, 0.006712711690736644, 0.005622387594527247, 0.0036174322578065485, 0.004716173126604516, 0.006840228808322394, 0.004727937528766648, 0.0032186872982608444, 0.0033700567874734456, 0.004467709925337937, 0.003167944796103446, 0.003596209038070516, 0.0031794490228067933, 0.0053716054592669185, 0.003350599765820655, 0.0045001071210240004, 0.005174569139590842, 0.0031960863092472787, 0.002087900991083225, 0.0031127100931534362, 0.0019890082834525345, 0.005385759324266042, 0.0023289188713029115, 0.002249834395546703, 0.0018913228403927619], "time": 3.1995837688446045, "num_points": 185}], "prediction_cache": null}