{"hyperparameters": {"activation": "tanh", "batch_normalization": false, "dense_layer_l1_regularization": 0.001, "dropout_probability": 0.0, "early_stopping": true, "embedding_output_dim": 8, "kmer_size": 15, "layer_sizes": [32], "locally_connected_layers": [], "loss": "custom:mse_with_inequalities", "max_epochs": 500, "minibatch_size": 128, "output_activation": "sigmoid", "patience": 20, "peptide_amino_acid_encoding": "BLOSUM62", "random_negative_affinity_max": 50000.0, "random_negative_affinity_min": 20000.0, "random_negative_constant": 25, "random_negative_rate": 0.0, "train_data": {"pretrain_min_points": 1000, "subset": "quantitative"}, "validation_split": 0.1, "embedding_input_dim": 21, "allele_dense_layer_sizes": [], "peptide_dense_layer_sizes": [], "peptide_allele_merge_method": "multiply", "peptide_allele_merge_activation": "", "dense_layer_l2_regularization": 0.0, "init": "glorot_uniform", "embedding_init_method": "glorot_uniform", "optimizer": "rmsprop", "learning_rate": null, "left_edge": 4, "right_edge": 4, "random_negative_match_distribution": true, "random_negative_distribution_smoothing": 0.0}, "_network": null, "network_json": {"class_name": "Model", "config": {"name": "predictor", "layers": [{"name": "peptide", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 21], "dtype": "float32", "sparse": false, "name": "peptide"}, "inbound_nodes": []}, {"name": "flattened_0", "class_name": "Flatten", "config": {"name": "flattened_0", "trainable": true}, "inbound_nodes": [[["peptide", 0, 0, {}]]]}, {"name": "dense_0", "class_name": "Dense", "config": {"name": "dense_0", "trainable": true, "units": 32, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0010000000474974513, "l2": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flattened_0", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_0", 0, 0, {}]]]}], "input_layers": [["peptide", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.1.3", "backend": "tensorflow"}, "network_weights": null, "network_weights_loader": null, "fit_info": [{"val_loss": [0.5739539917717632, 0.4621802400320004, 0.37223011433568776, 0.2971025598354829, 0.23845452274012768, 0.19251489919475, 0.16673477490743002, 0.15234039036127237, 0.14126275518001655, 0.12446730182721065, 0.12145829837546389, 0.11645985783165337, 0.10385301352566124, 0.09506853886394419, 0.08978776379018767, 0.08732967830111837, 0.08051298647864252, 0.07831238312089545, 0.10045837693744236, 0.0863134054801403, 0.07259744342066284, 0.06881216034675255, 0.07313424183262719, 0.08817913485133749, 0.06759458417311692, 0.0636027348984001, 0.06495146402436444, 0.06523495122917697, 0.06425261771322316, 0.06289091260514708, 0.06713547150039265, 0.061436830486497306, 0.06131834466742654, 0.05868401976986828, 0.0755677469011046, 0.06273076734226993, 0.0570088435187299, 0.06413433509759414, 0.056777891249228746, 0.08684164725053005, 0.054269519244503774, 0.11043799700390579, 0.060044231832536876, 0.05412931205370487, 0.05491201662354999, 0.056090378353738375, 0.05503466591621057, 0.05541362673935727, 0.055062342785362504, 0.06242462585115025, 0.06152368674420903, 0.055227419886833586, 0.0526869341922112, 0.060368297828568354, 0.06400267754355048, 0.0558016252441284, 0.05380360546529803, 0.05697637592625414, 0.061558234895396434, 0.06383370907388182, 0.08169859329349974, 0.07443002700550944, 0.056460839751948655, 0.06616846714009586, 0.06778936342805879, 0.057268331193516396, 0.05130494634310404, 0.07976689807370178, 0.054147574700351454, 0.05340741288203459, 0.11106716281073725, 0.06305424748068182, 0.05338616185208671, 0.054587580327294834, 0.05327661383228424, 0.0519850655243947, 0.08077390950459701, 0.05231888318418437, 0.07045402282323593, 0.050493345428735785, 0.0527752787193172, 0.055899434301078826, 0.053121367740070716, 0.06385643047909452, 0.053182276172770396, 0.056277802038905964, 0.07388387442144573, 0.05646724215684793, 0.05412330019932527, 0.06610677525019035, 0.06075678097131925, 0.05380465348179524, 0.05019240622591768, 0.052714225127656236, 0.05175414608202429, 0.051908107649566784, 0.05240351649431082, 0.05275247857356683, 0.053967707050152317, 0.05956829396577982, 0.057226267444272325, 0.08599367088232285, 0.053275381397997215, 0.05936880205940996, 0.051157624739357546, 0.054961460841517165, 0.05888389872434812, 0.050389942641441636, 0.05055656003901082, 0.051345998755632304, 0.05787649222164073, 0.05400873176180399, 0.04898884367102232, 0.05663866664354618, 0.05754954316931912, 0.0511208984714288, 0.052922238014702104, 0.05150899841872036, 0.05357149071418322, 0.06396590415229145, 0.049020239749015905, 0.052817044413497306, 0.05268925425206494, 0.04968979770047033, 0.05345423646971711, 0.05794878431365021, 0.05841594163933371, 0.05138289565459276, 0.054394661170295164, 0.05478485953858775, 0.051720789291410364, 0.052161449359522924, 0.05026041534848702, 0.047984299751428455, 0.05031139763374614, 0.049808665855318054, 0.04873556446315896, 0.05374701805094369, 0.049123159967936, 0.055069884492291346, 0.05061744803037399, 0.0512309870404056, 0.051617099370202445, 0.054752523445675515, 0.051709308742712706, 0.049746716697501324, 0.05092673309338398, 0.050746481579083666, 0.06275483475536363, 0.05553836483731229, 0.04882689641836362, 0.0504490030117524, 0.06204610642714378, 0.053512786698137596, 0.05103702184099417], "loss": [0.6605962497262982, 0.5150418583271729, 0.4101905511946083, 0.3258167668338954, 0.25904677500033857, 0.20556729308927024, 0.16936745633103942, 0.14645473380618373, 0.13208344574481448, 0.11984795917915775, 0.11044711860392183, 0.1003372038797155, 0.096008872622189, 0.08743269983732326, 0.08373486495677122, 0.07885725706730488, 0.07551672779115981, 0.07154127863813742, 0.06908629695441862, 0.07084247929437372, 0.06624145565769352, 0.06253753401147286, 0.06359454231590629, 0.06301002871703261, 0.06186439556462976, 0.05992247293515928, 0.058804387079322756, 0.05750712455455409, 0.059407100997673434, 0.054758880781036426, 0.05635007582356295, 0.05801550090469214, 0.05387197505217489, 0.0553315741119212, 0.05159150485883336, 0.05373549592051765, 0.054345092634085365, 0.053179509284328116, 0.05407212221474734, 0.05173285887909572, 0.05035683750978416, 0.05046917571978301, 0.05249591924967484, 0.051151650202228865, 0.04937404921869645, 0.04871283376410078, 0.05295379309994022, 0.051424568066208334, 0.050658428265550684, 0.0493515502551377, 0.048847902566194534, 0.0487529113178485, 0.04816313235673368, 0.04936099853952574, 0.049579390817391975, 0.050543739862590885, 0.04767105595570047, 0.04855299178862481, 0.048268022631837486, 0.05064088723367458, 0.04610159932444843, 0.04983592669420065, 0.04842124345603162, 0.048765136072815206, 0.047592259709100936, 0.04922205656837917, 0.04846375299931936, 0.0477694725427773, 0.049790605021954946, 0.046379409407268146, 0.045195791444202285, 0.04821071312456499, 0.04941250465533299, 0.04702932026425467, 0.04819934970359216, 0.04632902695123529, 0.04591747185835052, 0.0494116380086277, 0.04473862428399242, 0.04949257585679041, 0.046681866809739965, 0.04829269736025081, 0.04566656723547482, 0.045453485019782025, 0.046029305247122954, 0.05003631647296243, 0.04525400175436891, 0.048980540355349635, 0.04454260155757458, 0.046331957941457586, 0.044103289696008845, 0.0494759458874497, 0.04482293732329365, 0.047071133817486586, 0.04572816204467879, 0.04580138992337071, 0.045400017472934, 0.0443526827388428, 0.04655978851396771, 0.04528538875629836, 0.04540344334080517, 0.045123721910613965, 0.04600766990102963, 0.04539016438905572, 0.0447684608335945, 0.04591110115382533, 0.043914147754784874, 0.04545949000662798, 0.04546055154035044, 0.04546721104898262, 0.04439789628533662, 0.04340611732040165, 0.046340248022793136, 0.04310695309586134, 0.04499067621460066, 0.04499312717151483, 0.04408108191236186, 0.04432316684120604, 0.04460143157635221, 0.044321361684140075, 0.045760724469806266, 0.04315593104287485, 0.04578846192308786, 0.04351703151066151, 0.04439829336790043, 0.04411896713454457, 0.04398124624182203, 0.044946269869974846, 0.043609480615936086, 0.04315755090314906, 0.042248721750323494, 0.04315309131338667, 0.04326514961522914, 0.04350425116540251, 0.04337050976698687, 0.04323819461496133, 0.04341361633332373, 0.0443843577707007, 0.04209667933595192, 0.04209798342549199, 0.04364338395735329, 0.04196841761583482, 0.04381768463678424, 0.042897367152119954, 0.04270870149050359, 0.042731419163050254, 0.04147446053271298, 0.042808100183426026, 0.040891859044735496, 0.04243300316075806, 0.04232226503929487, 0.04174953213652278, 0.04206110200391029, 0.043229112367867514, 0.041570642872494214], "time": 36.58441662788391, "num_points": 2132}, {"val_loss": [0.07507894188165665, 0.06769650429487228, 0.06189453974366188, 0.10412101447582245, 0.07615754008293152, 0.0805518627166748, 0.07836583256721497, 0.06882891058921814, 0.07636373490095139, 0.06437710672616959, 0.06711074709892273, 0.07317033410072327, 0.07022078335285187, 0.07435548305511475, 0.06574138253927231, 0.09288115799427032, 0.08346617966890335, 0.08560734987258911, 0.06553420424461365, 0.0664898008108139, 0.07731934636831284, 0.08179312199354172, 0.06682106852531433, 0.09915801882743835], "loss": [0.023089398429324774, 0.019995407012689537, 0.01888614132329582, 0.020806356162503602, 0.023905206196177812, 0.019365148564914416, 0.019218094000095724, 0.018795117316617843, 0.018308265212551956, 0.01938619081326236, 0.019768249926268095, 0.02236037506119998, 0.01901146357465787, 0.02026975701092907, 0.017569060937480528, 0.02272170731779847, 0.01940740308936961, 0.01876962378956497, 0.017784256320386837, 0.019407036573509312, 0.016753965102351748, 0.016124072703278335, 0.01697022478332761, 0.02013841257026341], "time": 2.214733123779297, "num_points": 146}], "prediction_cache": null}