{
  "hyperparameters": {
    "activation": "tanh",
    "batch_normalization": false,
    "dense_layer_l1_regularization": 0.001,
    "dropout_probability": 0.0,
    "early_stopping": true,
    "embedding_output_dim": 8,
    "kmer_size": 15,
    "layer_sizes": [
      32
    ],
    "locally_connected_layers": [],
    "loss": "custom:mse_with_inequalities",
    "max_epochs": 500,
    "minibatch_size": 128,
    "output_activation": "sigmoid",
    "patience": 20,
    "peptide_amino_acid_encoding": "BLOSUM62",
    "random_negative_affinity_max": 50000.0,
    "random_negative_affinity_min": 20000.0,
    "random_negative_constant": 25,
    "random_negative_rate": 0.0,
    "train_data": {
      "pretrain_min_points": 1000,
      "subset": "quantitative"
    },
    "validation_split": 0.1,
    "embedding_input_dim": 21,
    "allele_dense_layer_sizes": [],
    "peptide_dense_layer_sizes": [],
    "peptide_allele_merge_method": "multiply",
    "peptide_allele_merge_activation": "",
    "dense_layer_l2_regularization": 0.0,
    "init": "glorot_uniform",
    "embedding_init_method": "glorot_uniform",
    "optimizer": "rmsprop",
    "learning_rate": null,
    "left_edge": 4,
    "right_edge": 4,
    "random_negative_match_distribution": true,
    "random_negative_distribution_smoothing": 0.0
  },
  "_network": null,
  "network_json": {
    "class_name": "Model",
    "config": {
      "name": "predictor",
      "layers": [
        {
          "name": "peptide",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              15,
              21
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "peptide"
          },
          "inbound_nodes": []
        },
        {
          "name": "flattened_0",
          "class_name": "Flatten",
          "config": {
            "name": "flattened_0",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "peptide",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "dense_0",
          "class_name": "Dense",
          "config": {
            "name": "dense_0",
            "trainable": true,
            "units": 32,
            "activation": "tanh",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0.0010000000474974513,
                "l2": 0.0
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "flattened_0",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "output",
          "class_name": "Dense",
          "config": {
            "name": "output",
            "trainable": true,
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "dense_0",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "peptide",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "output",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.1.3",
    "backend": "tensorflow"
  },
  "network_weights": null,
  "network_weights_loader": null,
  "fit_info": [
    {
      "val_loss": [
        0.48419818756592214,
        0.3348347805625764,
        0.23024571364495292,
        0.15949492238054228,
        0.12550978340319732,
        0.1175578127971929,
        0.0908092098375458,
        0.08970824491918383,
        0.07199802768615941,
        0.0707265250940821,
        0.06253171758494568,
        0.05661630007758069,
        0.06758957345094253,
        0.05386758593851654,
        0.04772338736338995,
        0.05791368698747597,
        0.05310219433621981,
        0.05160840495086428,
        0.04698607295899842,
        0.0408693471024582,
        0.07842035239460457,
        0.04856450522123878,
        0.05116803304695371,
        0.03855091987631807,
        0.04326648632092262,
        0.03876335652016882,
        0.042143956030630945,
        0.036022427515010925,
        0.03729640879663662,
        0.042906051066087844,
        0.058518561112940015,
        0.040247560742853294,
        0.034140142153448134,
        0.03502549958503365,
        0.04004804532400411,
        0.0462172815381591,
        0.03711018398107581,
        0.05629724534738123,
        0.04752720195559127,
        0.03761922204820671,
        0.034293582153261004,
        0.03694965456848714,
        0.039310861693982464,
        0.034245208276445,
        0.03488981475432714,
        0.03284303389897394,
        0.0389301735740989,
        0.04058501587726584,
        0.04168410045071621,
        0.032347960972148385,
        0.032110704822623314,
        0.03187633980417726,
        0.03348974726019214,
        0.03525319076444379,
        0.03582607176321656,
        0.03510654723243927,
        0.03230743680093715,
        0.03666204543997399,
        0.03946724771267146,
        0.03770957427534891,
        0.03418663082023462,
        0.03396855108439922,
        0.03110850717297834,
        0.044240104321816666,
        0.03365540209768424,
        0.05136782831665295,
        0.03128327261563854,
        0.03037886048171354,
        0.03365244293835626,
        0.036341253844140775,
        0.031049055190970055,
        0.02960383947660674,
        0.0342753105125024,
        0.03006998809119362,
        0.030529943994473462,
        0.035751566976605365,
        0.03251655725067231,
        0.03727004269314049,
        0.030554154155711038,
        0.030790415532256834,
        0.03048144081672329,
        0.03176207902530829,
        0.03149072998272839,
        0.02942135028392818,
        0.03523596504063749,
        0.03224955185024596,
        0.029521686057397974,
        0.030744449119662762,
        0.037737891096529086,
        0.03853473795661286,
        0.034719390192286884,
        0.03101878798571392,
        0.02992625806981058,
        0.03003747809437377,
        0.03650934723627508,
        0.02953030030006793,
        0.02889460404936354,
        0.032002369312578764,
        0.031788098074458725,
        0.04684069619249942,
        0.028721735177941583,
        0.03417123711450183,
        0.03410415588623256,
        0.031498123331004706,
        0.03143493433608048,
        0.034885280520020434,
        0.029373614682783534,
        0.03980679454198524,
        0.03004740349095852,
        0.029050038358317085,
        0.03022836090357446,
        0.02924365829213045,
        0.028716347555616008,
        0.04021350913379916,
        0.029997804827654538,
        0.034247607817474886,
        0.02933920882827607,
        0.036901708377237934,
        0.03257626569389704,
        0.03431023732383749,
        0.041225948672167105,
        0.028762381412644884,
        0.03361468508246526,
        0.03186276985045096,
        0.03102444460735985,
        0.03486343816997697,
        0.028215996290913863,
        0.031828862202553015,
        0.029702664051779466,
        0.030478835661909474,
        0.02866728766937161,
        0.028657988547834,
        0.037607412210744415,
        0.029596677661609293,
        0.03015666919301695,
        0.04176727732393279,
        0.03335314940902131,
        0.02897937993393905,
        0.02878834882667705,
        0.030883627559118602,
        0.028939216235532098,
        0.03094115082304276,
        0.030107546143641518,
        0.02961383658039629,
        0.028606513941391784,
        0.02924347533589572,
        0.02908580774320892,
        0.03053129115026092
      ],
      "loss": [
        0.598317250947873,
        0.4079047017645638,
        0.27659837395530656,
        0.18858835666628757,
        0.13998008618889754,
        0.1137682309523844,
        0.09755725390858268,
        0.08447142223572136,
        0.07471605603508341,
        0.06882532853994343,
        0.06320999220550226,
        0.05923504014796167,
        0.05620220781115614,
        0.05257675115050041,
        0.051120646291740054,
        0.0490899824534757,
        0.047256921615627,
        0.046649138631500366,
        0.04368691561831332,
        0.043505801409070184,
        0.042878181241721,
        0.04303478528216605,
        0.04203971814663456,
        0.04041629495238498,
        0.040622232354909096,
        0.04008170398070872,
        0.03890012820300303,
        0.03971173659668735,
        0.03731805599421015,
        0.037715851513467666,
        0.03716286548369479,
        0.037295098906161055,
        0.03637878208568222,
        0.035965777597186305,
        0.036662667620297615,
        0.035431789064011086,
        0.03515948940718603,
        0.03464527057065858,
        0.034134610956973316,
        0.03459365332081212,
        0.03425259132381952,
        0.033422501414106166,
        0.03247156759873652,
        0.03283183197813351,
        0.033460459720931555,
        0.03186707717993418,
        0.03244886504811263,
        0.0323626623094247,
        0.03135709646789982,
        0.03206698397520176,
        0.031105690241025094,
        0.03121047687621328,
        0.03070102246514318,
        0.030621399980172555,
        0.031194903866653627,
        0.030154812081079733,
        0.030886914764745085,
        0.030412202664854785,
        0.030589844982998854,
        0.029734466272377903,
        0.030451983646837957,
        0.029534731642278607,
        0.030343322127727262,
        0.02920020648131245,
        0.030065970471608673,
        0.02970554904800703,
        0.029690855464941907,
        0.029705016910410654,
        0.029476874181355795,
        0.029346976286816796,
        0.029382195241150762,
        0.02933401331677001,
        0.02933542847612723,
        0.029016568934818385,
        0.029377350557874115,
        0.029367180086073783,
        0.028464779217528834,
        0.029489165216354123,
        0.0290466556485505,
        0.028677416712541,
        0.028400781034515175,
        0.028271413825638077,
        0.028840457082537733,
        0.028914643297812945,
        0.028239966794807166,
        0.02829052187151526,
        0.028385784371737957,
        0.028869261926973956,
        0.027890127430827333,
        0.02846943495428793,
        0.028401659957424757,
        0.028636256706516497,
        0.028274551374512697,
        0.02835267967856657,
        0.027691231969320874,
        0.028029973736842913,
        0.02842976578261053,
        0.028214406234488263,
        0.02842992546238067,
        0.02750754348541561,
        0.028499145786228933,
        0.028069341975235872,
        0.027803263406674286,
        0.02757873502134286,
        0.027999321843943766,
        0.027775933191056396,
        0.02736963400529527,
        0.027690976441236744,
        0.02781263231570701,
        0.027380994249166214,
        0.027741731211047754,
        0.027659138672858723,
        0.0279884157212157,
        0.027736849207792257,
        0.027710545501591757,
        0.02759973509469356,
        0.02785838302895633,
        0.026698226061677998,
        0.0278485254113694,
        0.02736915192486837,
        0.027164652704201906,
        0.028160652988835386,
        0.027421271848463945,
        0.027579876235647546,
        0.027210923447338168,
        0.027325888293849465,
        0.02772917921688418,
        0.02726942615227521,
        0.027360930868587006,
        0.027062854542296347,
        0.027444648142088815,
        0.028031008127158367,
        0.02677236970029049,
        0.02753645729510903,
        0.02728341296934355,
        0.026987009600754258,
        0.02698339099926136,
        0.027389354061675864,
        0.02708360810978261,
        0.026989190957387728,
        0.027071992198516127,
        0.02742203689513114,
        0.027174528481805092,
        0.02757564161045069,
        0.027417171036520162,
        0.027303581249350655,
        0.02666920748567647,
        0.026939974680873165
      ],
      "time": 55.17199468612671,
      "num_points": 3812
    }
  ],
  "prediction_cache": null
}
